In [42]:
# cols = "Summons Number,Plate ID,Registration State,Plate Type,Issue Date,Violation Code,Vehicle Body Type,Vehicle Make,Issuing Agency,Street Code1,Street Code2,Street Code3,Vehicle Expiration Date,Violation Location,Violation Precinct,Issuer Precinct,Issuer Code,Issuer Command,Issuer Squad,Violation Time,Time First Observed,Violation County,Violation In Front Of Or Opposite,House Number,Street Name,Intersecting Street,Date First Observed,Law Section,Sub Division,Violation Legal Code,Days Parking In Effect,From Hours In Effect,To Hours In Effect,Vehicle Color,Unregistered Vehicle?,Vehicle Year,Meter Number,Feet From Curb,Violation Post Code,Violation Description,No Standing or Stopping Violation,Hydrant Violation,Double Parking Violation".split(",")

Note: data contains some future dates

In [107]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [44]:
# cols

In [45]:
cols2 = ['Date First Observed', 'Plate ID','Registration State','Issue Date', 'Vehicle Make', 'Street Name', 'Vehicle Color']
len(cols2)

7

In [60]:
df = pd.read_csv('/Users/blauerbock/workspaces/pandas-workout/data/nyc-parking-violations-2020.csv', 
                 header=0, usecols=cols2)

In [62]:
df['Vehicle Color'].value_counts().head(12)

Vehicle Color
WH       2344858
GY       2307704
BK       2066374
WHITE    1061234
BL        775124
RD        483298
BLACK     465110
GREY      306787
BROWN     292348
SILVE     191477
GR        182929
BLUE      178298
Name: count, dtype: int64

In [64]:
df['Date First Observed'].value_counts()

Date First Observed
0           12371344
20200311         887
20200205         795
20200212         793
20200310         770
              ...
20200230           1
20190602           1
20220412           1
20160614           1
20190527           1
Name: count, Length: 465, dtype: int64

In [65]:
df = pd.read_csv('/Users/blauerbock/workspaces/pandas-workout/data/nyc-parking-violations-2020.csv', 
                 header=0, usecols=cols2, index_col='Issue Date')

In [66]:
df.head()

,Plate ID,Registration State,Vehicle Make,Street Name,Date First Observed,Vehicle Color
Issue Date,,,,,,
05/08/1972 12:00:00 AM,J58JKX,NJ,HONDA,43 ST,0,BK
08/29/1977 12:00:00 AM,KRE6058,PA,ME/BE,UNION ST,0,BLK
10/03/1988 12:00:00 AM,444326R,NJ,LEXUS,CLERMONT AVENUE,0,BLACK
01/03/1990 12:00:00 AM,F728330,OH,CHEVR,DIVISION AVE,0,NaN
02/14/1990 12:00:00 AM,FMY9090,NY,JEEP,GRAND ST,0,GREY

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12495734 entries, 05/08/1972 12:00:00 AM to 06/04/2064 12:00:00 AM
Data columns (total 6 columns):
 #   Column               Dtype
---  ------               -----
 0   Plate ID             object
 1   Registration State   object
 2   Vehicle Make         object
 3   Street Name          object
 4   Date First Observed  int64
 5   Vehicle Color        object
dtypes: int64(1), object(5)
memory usage: 667.3+ MB

In [68]:
df.shape

(12495734, 6)

In [69]:
df.loc['01/02/2020 12:00:00 AM', 'Vehicle Make'].value_counts().head(3)

Vehicle Make
TOYOT    3829
HONDA    3593
FORD     3164
Name: count, dtype: int64

In [70]:
df.loc['06/01/2020 12:00:00 AM', 'Street Name'].value_counts().head(5)

Street Name
WB CONDUIT BLVD @ LI    1068
SB WEST ST @ LEROY S     335
EB HORACE HARDING EX     273
EB QUEENS BLVD @ 82N     245
WB ATLANTIC AVE @ CL     229
Name: count, dtype: int64

In [71]:
df = df.reset_index().set_index('Vehicle Color')

In [72]:
df

,Issue Date,Plate ID,Registration State,Vehicle Make,Street Name,Date First Observed
Vehicle Color,,,,,,
BK,05/08/1972 12:00:00 AM,J58JKX,NJ,HONDA,43 ST,0
BLK,08/29/1977 12:00:00 AM,KRE6058,PA,ME/BE,UNION ST,0
BLACK,10/03/1988 12:00:00 AM,444326R,NJ,LEXUS,CLERMONT AVENUE,0
NaN,01/03/1990 12:00:00 AM,F728330,OH,CHEVR,DIVISION AVE,0
GREY,02/14/1990 12:00:00 AM,FMY9090,NY,JEEP,GRAND ST,0
...,...,...,...,...,...,...
BR,01/03/2040 12:00:00 AM,62161MM,NY,FORD,3RD AVE,0
BLK,04/19/2045 12:00:00 AM,GYE7330,NY,HONDA,PELHAM PARK DR,0
GY,01/17/2049 12:00:00 AM,HNY4802,NY,FORD,LYDIG AVE,0
BLK,12/19/2063 12:00:00 AM,T687081C,NY,TOYOT,E 68 STREET,0
WHITE,06/04/2064 12:00:00 AM,3497ZN,WA,UTILI,W/S/O 182 STREET,0

In [77]:
df.loc[['BL', 'RD'],'Vehicle Make'].value_counts()

Vehicle Make
HONDA    184271
TOYOT    141817
FORD     122911
NISSA    117533
CHEVR     64142
          ...
WIBAC         1
COPPE         1
TENSC         1
TESSL         1
MITSB         1
Name: count, Length: 655, dtype: int64

In [79]:
df.loc[['BLUE', 'RED'],'Vehicle Make'].value_counts()

Vehicle Make
HONDA    39353
FORD     30990
TOYOT    30925
NISSA    24950
FRUEH    18506
         ...
LASER        1
HPAMO        1
ZYMER        1
PERMA        1
BUDD         1
Name: count, Length: 839, dtype: int64

In [78]:
df.loc[['BLUE', 'RED'], 'Vehicle Make'].value_counts().head(1)

Vehicle Make
HONDA    39353
Name: count, dtype: int64

### What three car makes were most often ticketed from January 2 through January 10?

In [82]:
df

,Vehicle Color,Plate ID,Registration State,Vehicle Make,Street Name,Date First Observed
Issue Date,,,,,,
05/08/1972 12:00:00 AM,BK,J58JKX,NJ,HONDA,43 ST,0
08/29/1977 12:00:00 AM,BLK,KRE6058,PA,ME/BE,UNION ST,0
10/03/1988 12:00:00 AM,BLACK,444326R,NJ,LEXUS,CLERMONT AVENUE,0
01/03/1990 12:00:00 AM,NaN,F728330,OH,CHEVR,DIVISION AVE,0
02/14/1990 12:00:00 AM,GREY,FMY9090,NY,JEEP,GRAND ST,0
...,...,...,...,...,...,...
01/03/2040 12:00:00 AM,BR,62161MM,NY,FORD,3RD AVE,0
04/19/2045 12:00:00 AM,BLK,GYE7330,NY,HONDA,PELHAM PARK DR,0
01/17/2049 12:00:00 AM,GY,HNY4802,NY,FORD,LYDIG AVE,0
12/19/2063 12:00:00 AM,BLK,T687081C,NY,TOYOT,E 68 STREET,0
06/04/2064 12:00:00 AM,WHITE,3497ZN,WA,UTILI,W/S/O 182 STREET,0

In [ ]:
df = df.reset_index().set_index('Issue Date')

In [84]:
df = df.sort_index()

In [87]:
df.loc['01/02/2020 12:00:00 AM':'01/10/2020 12:00:00 AM']['Vehicle Make'].value_counts()

Vehicle Make
FORD     38958
TOYOT    37096
HONDA    35962
NISSA    29583
CHEVR    20018
         ...
I NFI        1
ZENGH        1
OISUZ        1
WESTR        1
STUDE        1
Name: count, Length: 575, dtype: int64

In [88]:
df['Plate ID'].value_counts()

Plate ID
BLANKPLATE    8882
2704819       1535
86107MM       1429
2703289       1364
NS            1189
              ...
JSF1970          1
JMK8935          1
HZL1894          1
NDJ9265          1
M54FDG           1
Name: count, Length: 3245467, dtype: int64

In [90]:
df = df.reset_index()

In [93]:
df = df.set_index('Plate ID')

In [94]:
df.loc['2704819']

,Issue Date,Vehicle Color,Registration State,Vehicle Make,Street Name,Date First Observed
Plate ID,,,,,,
2704819,01/02/2020 12:00:00 AM,WHITE,IN,FRUEH,9th Ave,0
2704819,01/02/2020 12:00:00 AM,WHITE,IN,FRUEH,9th Ave,0
2704819,01/02/2020 12:00:00 AM,WHITE,IN,FRUEH,8th Ave,0
2704819,01/02/2020 12:00:00 AM,WHITE,IN,FRUEH,8th Ave,0
2704819,01/02/2020 12:00:00 AM,WHITE,IN,FRUEH,8th Ave,0
...,...,...,...,...,...,...
2704819,12/31/2019 12:00:00 AM,WHITE,IN,FRUEH,Penn Plz,0
2704819,12/31/2019 12:00:00 AM,WHITE,IN,FRUEH,9th Ave,0
2704819,12/31/2019 12:00:00 AM,WHITE,IN,FRUEH,9th Ave,0
2704819,12/31/2019 12:00:00 AM,WHITE,IN,FRUEH,Penn Plz,0
2704819,12/31/2019 12:00:00 AM,WHITE,IN,FRUEH,Penn Plz,0

In [96]:
df.loc['2704819', 'Street Name'].value_counts()

Street Name
8th Ave              395
Penn Plz             230
7th Ave               92
9th Ave               63
Broadway              57
                    ...
6TH AVE                1
W 54TH ST              1
E 39th St              1
N/S NW C/O W 30TH      1
E 49th St              1
Name: count, Length: 113, dtype: int64

### more discussion before Ex 22.

In [101]:
# let's assume 3 products * 3 years * 12 months = 108 sales figures
g = np.random.default_rng(0)  # 0 is the seed
g

Generator(PCG64) at 0x474A6D1C0

In [105]:
arr = g.integers(0, 100, [36,3])
arr[:5]

array([[69,  4, 81],
       [73, 18, 61],
       [50,  2, 92],
       [71, 31,  1],
       [ 9, 75, 14]])

In [108]:
df = DataFrame(arr,
    columns=list('ABC'))
df['year'] = [2018] * 12 + [2019] * 12 + [2020] * 12
df['month'] = """Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec""".split() * 3

In [109]:
df.head()

    A   B   C  year month
0  69   4  81  2018   Jan
1  73  18  61  2018   Feb
2  50   2  92  2018   Mar
3  71  31   1  2018   Apr
4   9  75  14  2018   May

In [110]:
df = df.set_index(['year', 'month'])

In [111]:
df

             A   B   C
year month
2018 Jan    69   4  81
     Feb    73  18  61
     Mar    50   2  92
     Apr    71  31   1
     May     9  75  14
     Jun    51  89  92
     Jul    26   6  49
     Aug    84  62   6
     Sep    65  34  22
     Oct    43  87  96
     Nov    14  56  76
     Dec    25  27  24
2019 Jan    20  88  21
     Feb    22  12  12
     Mar    77  28  80
     Apr    58  85  55
     May    76  80   6
     Jun    56  45  28
     Jul    45  41  49
     Aug    81  82  62
     Sep    71  95  63
     Oct    36   8  55
     Nov    23  59   2
     Dec    84  94  14
2020 Jan    81  40   4
     Feb    90  94   4
     Mar    59  82  78
     Apr    41  85  82
     May    11   0  10
     Jun    36  10   7
     Jul    25  65  52
     Aug    27  95  70
     Sep    63  94  78
     Oct    12   3  86
     Nov    40   5  47
     Dec    38  43  42

In [112]:
# get the sales data for all products in 2018:
df.loc[2018]

        A   B   C
month
Jan    69   4  81
Feb    73  18  61
Mar    50   2  92
Apr    71  31   1
May     9  75  14
Jun    51  89  92
Jul    26   6  49
Aug    84  62   6
Sep    65  34  22
Oct    43  87  96
Nov    14  56  76
Dec    25  27  24

In [113]:
# get all sales data for just products A and C in 2018:
df.loc[2018, ['A', 'C']]

        A   C
month
Jan    69  81
Feb    73  61
Mar    50  92
Apr    71   1
May     9  14
Jun    51  92
Jul    26  49
Aug    84   6
Sep    65  22
Oct    43  96
Nov    14  76
Dec    25  24

In [114]:
df.loc[(2018, 'Jun')]

A    51
B    89
C    92
Name: (2018, Jun), dtype: int64

In [115]:
df.loc[(2018, 'Jun'), ['A', 'C']]

A    51
C    92
Name: (2018, Jun), dtype: int64

In [116]:
# all data for 2018 and 2020:
df.loc[[2018, 2020]]

             A   B   C
year month
2018 Jan    69   4  81
     Feb    73  18  61
     Mar    50   2  92
     Apr    71  31   1
     May     9  75  14
     Jun    51  89  92
     Jul    26   6  49
     Aug    84  62   6
     Sep    65  34  22
     Oct    43  87  96
     Nov    14  56  76
     Dec    25  27  24
2020 Jan    81  40   4
     Feb    90  94   4
     Mar    59  82  78
     Apr    41  85  82
     May    11   0  10
     Jun    36  10   7
     Jul    25  65  52
     Aug    27  95  70
     Sep    63  94  78
     Oct    12   3  86
     Nov    40   5  47
     Dec    38  43  42

In [117]:
df.loc[[2018, 2020], ['B', 'C']]

             B   C
year month
2018 Jan     4  81
     Feb    18  61
     Mar     2  92
     Apr    31   1
     May    75  14
     Jun    89  92
     Jul     6  49
     Aug    62   6
     Sep    34  22
     Oct    87  96
     Nov    56  76
     Dec    27  24
2020 Jan    40   4
     Feb    94   4
     Mar    82  78
     Apr    85  82
     May     0  10
     Jun    10   7
     Jul    65  52
     Aug    95  70
     Sep    94  78
     Oct     3  86
     Nov     5  47
     Dec    43  42

What if we want to get all the data from June in both 2018 and 2020? It’s a little
complicated:
 We use square brackets with loc.
 The first argument in the square brackets describes the rows we want (i.e., a
row selector).
 We want all columns, so there isn’t a second argument to loc.
 We want to select multiple combinations from the multi-index, so we need a
list.
 Each year-month combination is a separate tuple in the list.
The result is

In [118]:
df.loc[[(2018, 'Jun'), (2020, 'Jun')]]

             A   B   C
year month
2018 Jun    51  89  92
2020 Jun    36  10   7

In [120]:
# What if we want to look at all values from June, July, or August across all three years?
# We could, of course, do it manually:

df.loc[[(2018, 'Jun'), (2018, 'Jul'), (2018, 'Aug'),
  (2019, 'Jun'), (2019, 'Jul'), (2019, 'Aug'),
  (2020, 'Jun'), (2020, 'Jul'), (2020, 'Aug')]]

             A   B   C
year month
2018 Jun    51  89  92
     Jul    26   6  49
     Aug    84  62   6
2019 Jun    56  45  28
     Jul    45  41  49
     Aug    81  82  62
2020 Jun    36  10   7
     Jul    25  65  52
     Aug    27  95  70

In [122]:
# df.loc[([2018, 2019, 2020], ['Jun', 'Jul', 'Aug'])]  # does NOT work

In [123]:
df.loc[([2018, 2019, 2020], ['Jun', 'Jul', 'Aug']), ['A', 'B', 'C']]

             A   B   C
year month
2018 Jun    51  89  92
     Jul    26   6  49
     Aug    84  62   6
2019 Jun    56  45  28
     Jul    45  41  49
     Aug    81  82  62
2020 Jun    36  10   7
     Jul    25  65  52
     Aug    27  95  70

In [124]:
df.loc[([2018, 2019, 2020], ['Jun', 'Jul', 'Aug']), 'A':'C']

             A   B   C
year month
2018 Jun    51  89  92
     Jul    26   6  49
     Aug    84  62   6
2019 Jun    56  45  28
     Jul    45  41  49
     Aug    81  82  62
2020 Jun    36  10   7
     Jul    25  65  52
     Aug    27  95  70

In [125]:
df.loc[([2018, 2019, 2020], ['Jun', 'Jul', 'Aug']), :]

             A   B   C
year month
2018 Jun    51  89  92
     Jul    26   6  49
     Aug    84  62   6
2019 Jun    56  45  28
     Jul    45  41  49
     Aug    81  82  62
2020 Jun    36  10   7
     Jul    25  65  52
     Aug    27  95  70

In [129]:
# df.loc[(:, ['Jun', 'Jul', 'Aug']), 'A':'B']
# Does NOT work. Python only allows the colon within square brackets.
# Replace : with slice(None)

In [128]:
df.loc[(slice(None), ['Jun', 'Jul', 'Aug']), 'A':'B']

             A   B
year month
2018 Jun    51  89
2019 Jun    56  45
2020 Jun    36  10
2018 Jul    26   6
2019 Jul    45  41
2020 Jul    25  65
2018 Aug    84  62
2019 Aug    81  82
2020 Aug    27  95